advanced/frontend/controllers/DayController.php

INSERT INTO `book` (`id`) VALUES (DEFAULT)
---
    public function actionInset(){
    	//添加
    	$data = $_POST;
    	$db = Yii::$app->db;
    	$db->createCommand()->insert('book', $data)->execute();   //执行添加入库