advanced/frontend/controllers/LiuyanController.php

    public function actionUpdate(){
    	//查询单条数据
    	$id = $_GET['id'];
    	// $db = \Yii::$app->db;
    	// $sql = "SELECT * FROM book WHERE id=".$id;
    	// //$data=$db->createCommand($sql)->queryRow();
     //    $data=$db->createCommand($sql)->queryAll();

        //query类
        $db = new Query();
        $data = $db->select("*")->from("liuyan")->where("id=".$id)->one();
---
SELECT * FROM `liuyan` WHERE id=22